app/mailers/users_mailer.rb

SELECT "users".* FROM "users"
---
  def daily
    @users = User.all
    @users.each do |user|